Week 2 Pandas

#05: Membalik urutan baris dan kolom pada Data Frame

In [27]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [28]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  4  2  7  5
1  4  3  2  6  6
2  9  7  8  2  3
3  6  9  8  3  5
4  5  6  4  6  3

Membalik urutan kolom

In [29]:
df.loc[:, ::-1]

   E  D  C  B  A
0  5  7  2  4  1
1  6  6  2  3  4
2  3  2  8  7  9
3  5  3  8  9  6
4  3  6  4  6  5

Membalik urutan baris

In [30]:
df.loc[::-1]

   A  B  C  D  E
4  5  6  4  6  3
3  6  9  8  3  5
2  9  7  8  2  3
1  4  3  2  6  6
0  1  4  2  7  5

Membalik urutan baris dan melakukan penyesuaian ulang index

In [31]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  5  6  4  6  3
1  6  9  8  3  5
2  9  7  8  2  3
3  4  3  2  6  6
4  1  4  2  7  5

#06: Mengganti nama (label) kolom pada Data Frame

Persiapan Data Frame

In [32]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  4  5  8  7
1  6  5  7  9  7
2  1  2  4  9  3
3  7  1  1  9  9
4  3  1  9  5  9

Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [33]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  2  4     5  8  7
1  6  5     7  9  7
2  1  2     4  9  3
3  7  1     1  9  9
4  3  1     9  5  9

Mengganti nama (label) untuk banyak kolom pada Data Frame

In [34]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     2       4  5     8  7
1     6       5  7     9  7
2     1       2  4     9  3
3     7       1  1     9  9
4     3       1  9     5  9

#07: Menghapus (drop) missing values (NaN)

Persiapan Data Frame

In [35]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  0.994783       NaN  0.265351       NaN
1      1  0.123165 -0.199647 -0.000258 -0.893141
2      2 -0.181440  1.375093  0.029293  0.799125
3      3  1.398520  0.550029 -0.400392 -1.092522
4      4  0.230166  0.714318 -1.823903 -0.003355

In [36]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  0.994783       NaN  0.265351       NaN
1  1  0.123165 -0.199647 -0.000258 -0.893141
2  2 -0.181440  1.375093  0.029293  0.799125
3  3  1.398520  0.550029 -0.400392 -1.092522
4  4  0.230166  0.714318 -1.823903 -0.003355

In [37]:
df_backup = df.copy(deep=True)

Menghapus (drop) setiap kolom yang mengandung missing values

In [38]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

Menghapus (drop) setiap baris yang mengandung missing values

In [39]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

     Z         A         B         C         D
1    1  0.123165 -0.199647 -0.000258 -0.893141
2    2 -0.181440  1.375093  0.029293  0.799125
3    3  1.398520  0.550029 -0.400392 -1.092522
4    4  0.230166  0.714318 -1.823903 -0.003355
12  12  0.260091 -0.486174  1.079145  0.577820

Persentase missing values untuk tiap kolom

In [40]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.133333
B    0.266667
C    0.166667
D    0.300000
dtype: float64

Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [41]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

#08: Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame

Persiapan Data Frame

In [42]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

Mengenal Pandas Series

In [43]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [44]:
type(df['A'])

pandas.core.series.Series

In [45]:
type(df)

pandas.core.frame.DataFrame

Memeriksa kesamaan dengan operator ==

In [46]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

Memeriksa kesamaan dengan method equals()

In [47]:
df['A'].equals(df['B'])

True

Memeriksa kesamaan antar dua Data Frame

In [48]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [49]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True